<div><div><p class="c1 c5"><span class="c2">Yves Citton &amp; Anthony Masure </span><span class="c2 c3">— </span><span class="c2">F</span><span class="c2 c3">iction pour le livre </span><span class="c2 c3 c6"><a class="c4" href="https://www.google.com/url?q=http://www.mediamediums.net/fr/projects&amp;sa=D&amp;usg=AFQjCNFWPZNqx3OdBQ_dsVrEcp9WFUWdvw">Haunted by Algorithms</a></span><span class="c2 c3 c7"> </span><span class="c2 c3">— </span><span class="c2 c8"><a class="c4" href="https://www.google.com/url?q=http://www.mediamediums.net&amp;sa=D&amp;usg=AFQjCNEunbfloRu71faIzl5wjtPd1bhayw">Meta Mediums</a></span><span class="c2"> — </span><span class="c2 c3">Jui</span><span class="c2">llet</span><span class="c2 c3"> 2015</span></p></div><p class="c1"><span># Anthony Masure et Yves Citton</span></p><p class="c1"><span># "if { 'attention-machine'; &gt; 2019pd =&gt; var data = require('attention.py'); } else</span><span> { fade; }".md</span></p><p class="c0"><span></span></p><p class="c1"><span>## AVANT</span></p><p class="c1"><span>C’était devenu le règne des boules de neige. Ils disaient : « attracteurs ». Quelqu’un lançait un truc. Avec un peu d’ingéniosité et beaucoup de chance, ça faisait du « buzz ». *Insect media* `[goto == Jussi Parikka]` : la dynamique de l’essaim et de l’essaimage. Ça agglomérait, ça coagulait, ça agrégeait, on y allait voir parce que les autres y allaient voir. Et forcément, on y trouvait quelque chose. Ça devenait intéressant parce qu’on le regardait assez longtemps `[goto == Gustave Flaubert]` ou assez nombreux `[goto == Jonathan Beller]`. Mais ce sont les regards (des autres) qui nous faisaient voir (et valoriser), plutôt que l’importance de la chose pour nous. Je regardais parce qu’ils regardaient. On regardait. Rien de très nouveau en soi. Sauf que l’accélération `[goto == Hartmut Rosa]`, l’extension `[goto == Marshall McLuhan]` et l’intensification `[goto == Bernard Stiegler]` produisaient ensemble des effets d’emballements inédits, qui déconnectaient dramatiquement l’organisme de son milieu matériel `[goto == David Abram]`. Le numérique réflexif (« web 2.0 ») avait colonisé les dynamiques de « publics » avec des comportements de « foules » `[goto == Gabriel Tarde]`. Les illuminés avaient parlé d’« intelligence collective » à propos des essaims. Les nostalgiques parlaient de « bêtise grégaire ». Tous deux avaient tort (et raison). Mais dans tous les cas, ça patinait, on perdait prise, les milieux et les formes de vie se délitaient, et on déprimait un peu.</span></p><p class="c0"><span></span></p><p class="c1"><span>## HANTOLOGIE</span></p><p class="c1"><span>Au sein du numérique réflexif qui donnait son infrastructure au capitalisme attentionnel, mes choix du moment étaient hantés par mes choix passés et par les choix de mes semblables. Sur les écrans, je ne voyais plus que des spectres : des *profils* `[goto == Thomas Berns &amp; Antoinette Rouvroy]`. Les profils communiquaient avec les profils, structurés par des algorithmes qui hantaient nos choix, qui n’étaient plus des « choix » humains, mais des résultantes d’influences relationnelles. Rien de très nouveau non plus, en réalité. Sauf que le numérique réflexif avait permis à tout ce jeu sous-jacent de prendre une consistance propre, une visibilité, une opérabilité inédite. Depuis les énormes hangars à serveurs à travers les câbles d’internet et jusqu’à nos écrans ubiquitaires, les spectres étaient enfin sortis des placards où l’humanisme rationaliste du libre-arbitre les avait soigneusement enfermés depuis des siècles. L’animal social avait toujours agi de façon spectrale (médiale, médiatique, médiumnique) `[goto == Jeff Guess &amp; Gwenola Wagon]`, L’arrière-plan refoulé pouvait enfin passé au devant de la scène. Les fantômes computés par les machines agitaient les fantômes incarnés par les vivants. Les humanistes se lamentaient : on ne savait plus où passait la limite entre vivants et non-vivants, humains et surhumains, esprits animaux et codes inanimés. C’était un monde de morts-vivants `[goto == Charles Tiphaigne]`, ballottés par des hallucinations de flux convergents et synchronisés (influx nerveux, flux électriques, courants informationnels, influences médiatiques) `[goto == Jeffrey Sconce]`. Les post-humanistes rêvaient les yeux ouverts. Les autres s’interrogaient : maintenant que nos fantômes pouvaient être analysés et reprogrammés par algorithmes, qu’allions-nous devenir ?</span></p><p class="c0"><span></span></p><p class="c1"><span>## APRÈS</span></p><p class="c1"><span>Ça avait effectivement aboli l’Histoire `[goto == Vilém Flusser]`. Mais on s’en foutait. C’était un peu désorientant, mais qu’est-ce qu’on respirait mieux ! L’horizon s’était débouché, réouvert, plus bas, plus étroit peut-être, mais quand même bien plus clair, plus sec, plus vivifiant.</span></p><p class="c0"><span></span></p><p class="c1"><span>## ENTRE-DEUX</span></p><p class="c1"><span>Un hack. Pardon: LE hack. *THE exploit* `[goto == Alexander Galloway et Eugene Thacker]` Celui qui avait tout changé. Celui qui nous avait fait sortir du capitalisme tardif en nous faisant sortir de l’économie de l’attention.</span></p><p class="c0"><span></span></p><p class="c1"><span>## AU COMMENCEMENT</span></p><p class="c1"><span>Ça avait été juste un simple script, à peine quelques lignes de code permettant d'autodétruire un site web au moment où il était repéré par les bots du moteur de recherche Google. Ce qui était censé capter des informations devenait l'agent de leur effacement, faisant ainsi de l'index du Web une sorte de Méduse algorithmique. Ne restait de cette expérience amateur `[goto == @mroth]` qu'un dépôt GitHub informant laconiquement que le site web de test avait disparu au bout de 22 jours.</span></p><p class="c0"><span></span></p><p class="c1"><span>```</span></p><p class="c1"><span>        if (n &gt; 0) {</span></p><p class="c1"><span>          var client   = config.redis.client();</span></p><p class="c1"><span>          // if the previous times indexed was null, this is the first time</span></p><p class="c1"><span>          // we were indexed!  so we need to record the historic moment.</span></p><p class="c1"><span>          // instead doing a query/response, let's be clever and use SETNX.</span></p><p class="c1"><span>          client.multi()</span></p><p class="c1"><span>                .set(["times_indexed", n])</span></p><p class="c1"><span>                .del("content")</span></p><p class="c1"><span>                .del("comments")</span></p><p class="c1"><span>                .setnx(["destroyed_at", (new Date()).toString()])</span></p><p class="c1"><span>                .exec(function (err, replies) {</span></p><p class="c0"><span></span></p><p class="c1"><span>                  if (err) {</span></p><p class="c1"><span>                    console.log("*** Error updating redis!");</span></p><p class="c1"><span>                    process.exit(1);</span></p><p class="c1"><span>                  }</span></p><p class="c0"><span></span></p><p class="c1"><span>                  console.log("-&gt; Set times_indexed to " + n + ":\t\t" + replies[0]);</span></p><p class="c1"><span>                  console.log("-&gt; Did we just destroy content?:\t"         + replies[1]);</span></p><p class="c1"><span>                  console.log("-&gt; Did we just destroy comments?:\t"        + replies[2]);</span></p><p class="c1"><span>                  console.log("-&gt; Did we initialize destroyed_at?:\t"  + replies[3]);</span></p><p class="c1"><span>                  client.quit();</span></p><p class="c1"><span>                });</span></p><p class="c1"><span>        }</span></p><p class="c1"><span>  }</span></p><p class="c1"><span>});</span></p><p class="c1"><span>```</span></p><p class="c1"><span>[source : « unindexed/scripts/query.js »](https://github.com/mroth/unindexed/blob/master/scripts/query.js)</span></p><p class="c1"><span>****</span></p><p class="c0"><span></span></p><p class="c1"><span>## OÙ ?</span></p><p class="c1"><span>Le changement de logo de Facebook était passé inaperçu. Le nom complet de la marque aux milliards d'usagers n'apparaissait quasi nulle part, se réduisant le plus souvent à l'affichage laconique d'une icône "f". Les guidelines « Google material » incitaient les webdesigner à charger à distance leurs fichiers typographiques "espion" via une combinaison de Javascript et de `CSS @font-face` ; promesse d'un chargement accéléré et d'un meilleur référencement. Rapidement, tous les sites et application se ressemblèrent. Répétition. Différence. `[goto == Gilles Deleuze]`</span></p><p class="c0"><span></span></p><p class="c1"><span>## QUAND ?</span></p><p class="c1"><span>C'est à cette époque que le virus avait été injecté au sein des populations européennes. Une dizaine d’images avaient suffi. Prises en photo au musée. C’était parti d’une image analogique. (Personne ne comprend encore comment ça a pu se faire.) L’image d’une tempête en mer. `[goto == Charles Tiphaigne]` Une image banale, un tableau sans mérite, une croûte – qui allait lancer une énorme lèpre dont crèverait le capitalisme numérique. On avait annoncé : « The Value of Art ». On s’attendait à un truc ironique. On ne savait qu’en penser. On avait cru comprendre quand on avait vu le petit dispositif installé en dessous du tableau : un détecteur de regard qui mesurait le temps que passait les spectateurs devant l’œuvre, relié à un petit rouleau de papier où une imprimante inscrivait les ajouts de valeur apportés par chaque seconde ajoutée d’attention humaine. `[goto == Christa Sommerer &amp; Laurent Mignonneau]`</span></p><p class="c0"><span></span></p><p class="c1"><span>## QUELS EFFETS ?</span></p><p class="c1"><span>Premiers symptômes : des blanchiments. D’abord une simple pâleur sur les photos de fin de soirée et des vacances sur la plage déposées sur les réseaux sociaux `[goto == Benoît Plateus]`. On accusait alors les fabriquants d'écran d'avoir mal conçu leurs *drivers* et des milliers de dalles avaient du être renvoyées aux entrepôts de Dell, Sony ou Samsung, leur occasionnant des pertes chiffrées à plusieurs millions d'euros. On croyait pouvoir facilement endiguer ces bugs. Mais Apple fut soudainement touché. Tous les écrans pâlissaient, vieillissaient prématurément. On avait dénoncé une obsolescence programmée à trop grande vitesse. Erreur de calcul ? Cupidité autodestructrice ? Le scandale était énorme. Les dirigeants juraient qu’ils n’y étaient pour rien. Personne ne les croyait. Ils rappelèrent toute la dernière génération d’iPad UltraRetina++, parce que les couleurs bien moins vives que celles de la précédente génération. L’obsolescence devenait un progrès inversé : dégénérescence. Les technophobes jubilaient. En fait, des hackers avaient réussi à craquer les codes du dernier iOS.</span></p><p class="c0"><span></span></p><p class="c1"><span>## QUELLE OCCASION ?</span></p><p class="c1"><span>C’est avec un vieil iPhone Edge qu’on avait pris un photo de la tempête en mer de « The Value of Art ». Les hackers – sans doute en connivence avec les artistes  – avaient réussi à introduire un effet de *feedback* entre l’œil de l’appareil-photo et le détecteur de regard placé sous le tableau. Ça s’était emballé, comme un effet Larsen d’attention machinique `[goto == Jean Baudrillard]`. Ça leur avait donné des idées...</span></p><p class="c0"><span></span></p><p class="c1"><span>## PAR QUELLE VOIE ?</span></p><p class="c1"><span>Le bug s’était répandu par un simple SMS permettant de redémarrer à distance n'importe quel iPhone le recevant en raison de la présence de caractères spéciaux non reconnus par l'OS `[goto == Reddit]`. Diffusé via n'importe quelle application de *chat*, ce hack minimaliste était passé inaperçu pendant que tout le monde se focalisait sur les problèmes liés à l'altération des images. Il ne tarda pas à muter. Un des *fork* les plus connus se basait sur une sonnerie MP3 permettant de reconfigurer les paramètres des OS Apple dans une zone de 20 mètres via un script diffusé en basse fréquence qui s'infiltrait dans les *devices* par leurs ports micro.</span></p><p class="c0"><span></span></p><p class="c1"><span>## QUELS MÉCANISMES ?</span></p><p class="c1"><span>L’exploit se nourrissait de traces d’attention. Le capitalisme numérique vivait de la collecte des traces d’attention. Il les traquait, les enregistrait, les mesurait, les computait, pour vendre des effets de frayage qui canalisaient et redéployaient l’attention vivante (traçante) à partir de l’attention morte (tracée). Le hack mimait toutes ces opérations, à une échelle étonnamment locale. En mettant un iPhone devant le tableau au lieu d’un regard humain, le coup de génie avait été de retourner du plus compliqué (l’attention humaine) au plus simple (l’attention préprogrammée). Il avait suffi d’apprendre au logiciel à détourner les finalités de la machinerie capitaliste : au lieu de vendre des promesses d’attention vivante par compilation des traces d’attention morte, le bug absorberait de l’attention machinique pour la faire imploser sur elle-même. Cette autophagie attentionnelle ne faisait en fait qu’exprimer `[goto == Deleuze sur Spinoza]` la dynamique essentielle du capitalisme médiatique.</span></p><p class="c0"><span></span></p><p class="c1"><span>## QUEL PRINCIPE ?</span></p><p class="c1"><span>``````````````````</span></p><p class="c1"><span>RUN: "au-delà d’un seuil très bas de condensation d’attention machinique, l’objet numérique s’auto-efface."</span></p><p class="c1"><span>``````````````````</span></p><p class="c1"><span>C’était la concentration de l’attention collective qui surexposait les plus vus, les plus lus, les plus entendus, les plus consultés – au point de les rendre invisibles. Au-delà d’un certain seuil, l’accumulation d’attention rendait les écrans opaques et muets. Tel avait été le génie du virus : le droit abstrait à l’opacité s’était incarné dans un algorithme reconditionnant concrètement l’ensemble des relations sociales `[goto == Pierre-Damien Huyghe]`.</span></p><p class="c0"><span></span></p><p class="c1"><span>## QUELLES CONSÉQUENCES ?</span></p><p class="c1"><span>Après Apple, ruiné par ses écrans pâlis, ça avait été au tour de Google. Les sites les plus haut placés en PageRank commençaient à s’effacer. D’abord difficiles à accéder, encombrés, lents : saturés. Puis simplement introuvables. Disparus !</span></p><p class="c0"><span></span></p><p class="c1"><span>## QUELLES SOLUTIONS ?</span></p><p class="c1"><span>On *patchait* WordPress à la va-vite qui équipait plus de 40% des sites dans le monde ; rien n'y faisait. Les exploits venaient de tous les côtés. Une des solutions les plus redoutables consistait à injecter une *admin-action* dans des URL placées stratégiquement sur des sites web à forte audience et permettant de cibler une liste de *plugins* vulnérables. En affichant les chaînes de caractères `wp_nonce` sensées authentifier l'administrateur du site, le *hack* pouvait alors exécuter un vulgaire `phpinfo()` et afficher les codes d'accès à la base de données stockés par exemple dans un `ajax_handler`.</span></p><p class="c0"><span></span></p><p class="c1"><span>```</span></p><p class="c1"><span>public function credentials_test() {</span></p><p class="c1"><span>            global $updraftplus;</span></p><p class="c1"><span>                $required_test_parameters = $this-&gt;do_credentials_test_parameters();</span></p><p class="c1"><span>                [...]</span></p><p class="c1"><span>                $this-&gt;storage = $this-&gt;bootstrap($_POST);</span></p><p class="c1"><span>                if (is_wp_error($this-&gt;storage)) {</span></p><p class="c1"><span>                    echo __("Failed", 'updraftplus').": ";</span></p><p class="c1"><span>                    foreach ($this-&gt;storage-&gt;get_error_messages() as $key =&gt; $msg) { echo "$msg\n"; }</span></p><p class="c1"><span>                    die;</span></p><p class="c1"><span>                }</span></p><p class="c1"><span>                [...]</span></p><p class="c1"><span>            die;</span></p><p class="c1"><span>        }</span></p><p class="c1"><span>```</span></p><p class="c1"><span>[source : « updraftplus/admin.php »](https://github.com/wp-plugins/updraftplus/blob/master/admin.php)</span></p><p class="c1"><span>****</span></p><p class="c0"><span></span></p><p class="c1"><span>## QUELLES CAUSES ?</span></p><p class="c1"><span>On avait parlé de réseaux sans cause à défendre `[goto == Geert Lovink]. On ne comprenait pas les motivations des hackers. Il ne s'agissait pas ici d'une énième attaque permettant d'extorquer des fonds en échange d'informations prises en otage. Les *black hats* n’y comprenaient rien.</span></p><p class="c0"><span></span></p><p class="c1"><span>## QUELS REMÈDES ?</span></p><p class="c1"><span>Le procédé était dirimant : plus un site était populaire, plus il était fréquemment indexé par Google, et plus il était atteint. C'était la simple expérience du site auto-détruit suite à son indexation qui refaisait surface, mais combinée aux failles altérant l'affichage des terminaux Apple. Des *white hats* avaient réussi à injecter au sein des principaux CMS (*Content Management Systems*) des scripts basés sur la librairie PHP *Imagegick* altérant définitivement les images les plus consultées. Toutes les 1000 vues, les images de ces pages web se complexifiaient, des pixels étant injectés dans les fichiers source *bitmap* en tenant compte des couleurs adjacentes `[goto == Jacques Perconte]`. En complément, à chaque fois qu'un *searchbot* atteignait l'image, celle-ci mutait à nouveau en intervertissant la position de 10 pixels.</span></p><p class="c0"><span></span></p><p class="c1"><span>```</span></p><p class="c1"><span>function addNoiseImage($noiseType, $imagePath, $channel) {</span></p><p class="c1"><span>        $imagick = new \Imagick(realpath($imagePath));</span></p><p class="c1"><span>        $imagick-&gt;addNoiseImage($noiseType, $channel);</span></p><p class="c1"><span>        header("Content-Type: image/jpg");</span></p><p class="c1"><span>        echo $imagick-&gt;getImageBlob();</span></p><p class="c1"><span>}</span></p><p class="c1"><span>```</span></p><p class="c1"><span>[source : « Imagick::addNoiseImage »](http://php.net/manual/fr/imagick.addnoiseimage.php)</span></p><p class="c1"><span>****</span></p><p class="c0"><span></span></p><p class="c1"><span>## QUELLE PROGRESSION ?</span></p><p class="c1"><span>Dans un premier temps, seuls les sites à très forte audience furent touchés, le procédé étant basé sur un coefficient attentionnel. Les images populaires perdaient en précision, s'altéraient, devenaient plus pâles jusqu'à disparaître des écrans mais pas des serveurs web qui, eux, saturaient. DDoS (*distributed denial-of-service*). Tout ce que l’attention machinique valorisait tendait à s'effacer. À chaque fois, le même processus : les couleurs pâlissent, l’image est attaquée d’un blanchiment qui la dévore en saturant son exposition. L’opacité reprend le dessus. La pub, elle, refluait, personne ne voulait disparaître. C'était le crépuscule de Google, dernière lumière avant l'extinction des feux.</span></p><p class="c0"><span></span></p><p class="c1"><span>## QUELLES RÉGRESSIONS ?</span></p><p class="c1"><span>On voyait déjà ré-émerger des vieux sites web exotiques, équipés de systèmes bricolés qui, eux, n'étaient pas touchés par les failles atteignant l'homogène des plateformes techniques dominantes. Exaltés par cette visibilité inattendue et complètement aléatoire, car dès qu'une destination devenait trop populaire elle était mise à mal, des groupes éphémères et anonymes se formaient et se déformaient, exploitant avec une grande créativité n'importe quelle faille technique `[goto == David M. Berry]`. Ce que l'on pensait initialement être des attaques dirigées vers le *Pagerank* se révélait plus complexe : c'étaient tous les condensateurs d'attention qui, progressivement, perdaient pied.</span></p><p class="c0"><span></span></p><p class="c1"><span>## QUELS ANTÉCÉDENTS ?</span></p><p class="c1"><span>Plus un produit suscitait de curiosité, de recommandations, d’achats, plus vite il disparaissait des écrans. Il y avait bien eu en 2012 cette initiative de *plugin* web librement installable permettant de rediriger les internautes vers les librairies de proximité `[goto == Amazon killer]`, mais il était alors réservé aux initiés.</span></p><p class="c0"><span></span></p><p class="c1"><span>```</span></p><p class="c1"><span>var buttons = require('sdk/ui/button/action');</span></p><p class="c1"><span>var tabs = require("sdk/tabs");</span></p><p class="c1"><span>var data = require("sdk/self").data;</span></p><p class="c1"><span>var pageMod = require("sdk/page-mod");</span></p><p class="c1"><span>var ISBN;</span></p><p class="c1"><span>var button = buttons.ActionButton({</span></p><p class="c1"><span>  id: "mozilla-link",</span></p><p class="c1"><span>  label: "Amazon killer",</span></p><p class="c1"><span> </span></p><p class="c1"><span>  [...]</span></p><p class="c0"><span></span></p><p class="c1"><span>function handleClick(state) {</span></p><p class="c1"><span>        tabs.open("http://www.placedeslibraires.fr/dlivre.php?gencod=" + ISBN + "&amp;rid=");</span></p><p class="c1"><span>}</span></p><p class="c1"><span>```</span></p><p class="c1"><span>[source : « Amazon-Killer »](https://github.com/elliotlepers/Amazon-Killer/blob/master/firefox/lib/main.js)</span></p><p class="c1"><span>****</span></p><p class="c0"><span></span></p><p class="c1"><span>## QUELLES CIRCULATIONS ?</span></p><p class="c1"><span>Des *hackers-esthètes* s'étaient inspirés des systèmes de localisation (GPS) reliés à des balises indiquant en temps réel la circulation routière et permettant de rediriger automatiquement les conducteurs vers des voies moins fréquentées `[goto == Waze]`. Dans les deux cas, il s’agissait de « décongestionner » des flux dont l’effet de masse devenait paralisant. Mais alors que l'efficacité primait dans le monde des voitures, ces scripts appliqués aux « autoroutes de l'information » permettaient de désencombrer la fréquentation d'une façon inversement proportionnelle au modèle du « gain ». On perdait même du temps dans ces parcours au temps élastique, qui variaient suivant les trajectoires précédentes. Mais on trouvait aussi de l'intérêt à être à l'arrêt, bloqué devant une page figée un bref instant.</span></p><p class="c0"><span></span></p><p class="c1"><span>## QUELS RENVERSEMENTS ?</span></p><p class="c1"><span>Motivés par les succès obtenus sur Facebook, Apple et Google, d'autres *hackers* avaient percé les algorithmes de recommandation d'Amazon et d'Alibaba. Une des solutions avait été d'intervenir sur les _cookies_ qui étaient depuis longtemps gérés par des entreprises de profilage et de *re-targeting* `[goto == Giorgio Agamben]`. Ces programmes-espion servaient désormais à repérer les items les plus vus, c'est-à-dire ceux qui devaient disparaître pour que d'autres soient visibles. Si vous aviez vu tel produit, vous étiez systématiquement redirigé vers un item dont la popularité était inversement proportionnelle à celle du premier. Les paramètres des *Impressions*, *Conversions*, *CPM* (*Cost Per Thousand Impression*), *CRT* (*Click Through Rate*), *VTC* (*View Through Conversions*), *CTC* (*Click Through Conversions*), *ROI* (*Return On Investment*), *eCPM* (*Effective Cost Per Thousand Impressions*), *eCPA* (*Effective Cost Per Acquisition*) et autres *CPA* (*Cost Per Acquisition*) subissaient des mutations techniques dont les effets combinés s'avéraient rapidement incontrôlables.</span></p><p class="c0"><span></span></p><p class="c1"><span>## QUELLES SUSPENSIONS ?</span></p><p class="c1"><span>Ce n'étaient désormais plus seulement les images des pages Web qui s'altéraient, mais également les textes. Ce vieux *plugin* Web `[goto == Wordless]` qui vidait les pages web de leurs textes était désormais injecté aléatoirement dans les navigateurs web sous une forme qui le faisait interagir avec les *metrics* d'audience. À chaque lecture d'un même paragraphe, l’écrit s'opacifiait un peu plus, le rendant moins disponible pour les autres. Dès qu'un texte inédit apparaissait, beaucoup se précipitaient dessus, le faisant immédiatement disparaître. La lecture d'articles de presse – écrits depuis longtemps dans leur grande majorité par des robots-journalistes – devenait une expérience contemplative.</span></p><p class="c0"><span></span></p><p class="c1"><span>```</span></p><p class="c1"><span>;(function() {</span></p><p class="c1"><span>  "use strict";  </span></p><p class="c1"><span>  [...]</span></p><p class="c1"><span>  window.__wlw.hideWords = function(jQuery) {</span></p><p class="c1"><span>        window.__wlw.getTextNodesIn(jQuery, jQuery('body')).remove();</span></p><p class="c1"><span>        jQuery('iframe').css('opacity',0);</span></p><p class="c1"><span>        jQuery('input').val('').attr('placeholder','');</span></p><p class="c1"><span>        jQuery('textarea').val('').attr('placeholder','');</span></p><p class="c1"><span>        jQuery('object').remove(); // bye, flash</span></p><p class="c1"><span>        window.__wlw.queued_update = false;</span></p><p class="c1"><span>  };</span></p><p class="c1"><span>  window.__wlw.loader();</span></p><p class="c1"><span>})();</span></p><p class="c1"><span>```</span></p><p class="c1"><span>[source : « Wordless Web »](http://www.wordlessweb.com)</span></p><p class="c1"><span>****</span></p><p class="c0"><span></span></p><p class="c1"><span>## QUELLES EXTINCTIONS ?</span></p><p class="c1"><span>Cela faisait déjà longtemps que les *newsletters* publicitaires avaient disparu: ces messages n'étaient même plus lisibles par les bots. Un projet d'anti-cloud, d'auto-altération et d'effacement des images vidait automatiquement nos disques dur locaux et distants, obèses de factures impayées, photos et messages auxquels nous n'aurons de toute façon jamais le temps de répondre. Automatiquement intégré dans chaque OS, cet oubli programmé faisait de nos disques dur des lieux terriblement humains où s'abîmaient nos mémoires `[goto == /u.bli/]`.</span></p><p class="c0"><span></span></p><p class="c1"><span>## QUELLES RENAISSANCES ?</span></p><p class="c1"><span>Puis ce fut au tour de Google Analytics d'être *hacké*. Les communautés *white hats* à l'origine de ces reconfigurations attentionnelles prirent alors le contrôle des *heatmaps*, ces outils de mesure sensés détecter l'attention par zones d'interaction. En reliant ces informations à des *librairies Javascript* type *jQuery* modifiées en amont depuis les serveurs-CDN des GAFAM, les fichiers CSS ordonnant la mise en page des sites Web pouvaient désormais être générés à la volée. Des `&lt;footer&gt;` non visibles habituellement remontaient en haut de page avant de redescendre, car trop vus. Des blocs `&lt;aside&gt;` se déplaçaient soudainement le centre de l’écran. En fait, c'est toute la mise en page des sites web qui s'animait progressivement, chaque changement étant répercuté en temps réel à l'ensemble des internautes, faisant fi des *cache serveur* délivrant à la chaîne des copies statiques. Le Web prenait vie.</span></p><p class="c0"><span></span></p><p class="c1"><span>## QUELLES ÉCRITURES ?</span></p><p class="c1"><span>Combinés, hybridés, contredits, réécrits, bricolés, hackés, *forkés*, patchés, optimisés, débattus, commentés, indentés, versionnés, oubliés, retrouvés, activés, plantés, mis en lumière, les programmes attentionnels devenaient l'objet de luttes et d'enjeux collectifs. On débattait (enfin), on se trompait (souvent), on rageait (parfois), on s'amusait (beaucoup).</span></p><p class="c0"><span></span></p><p class="c1"><span>## QUELLES MUTATIONS ?</span></p><p class="c1"><span>Des paysages multiples et contradictoires apparaissaient, refluaient et disparaissaient. Cette profusion algorithmique avait sa vie propre, s'hybridant et évoluant de façon autonome et imprévue :</span></p><p class="c0"><span></span></p><p class="c1"><span>*   Le *robocopyright* « ContentID » de Google qui traquait sans relâche les vidéos en ligne enfreignant les volontés des ayants-droit s'était renommé de lui-même en « AttentionID », affectant à chaque vidéo un « coefficent d'accélération » à partir duquel d'autres programmes pouvaient déclencher des actions spécifiques par effets de seuil.</span></p><p class="c1"><span>*   Ajoutant quelques millisecondes aux vidéos en ligne en fonction du *ranking* « AttentionID », le script « slow_max_views.js » avait par exemple étiré à 30h la durée du clip « Gargantuan style » déjà vu plusieurs milliards de fois, plafonnant ainsi son expansion sans limite. Il en allait de même les *tweets* : plus ils étaient diffusés (`RT`), plus ils se dégradaient par la soustraction de caractères typographiques. Invisibles !</span></p><p class="c1"><span>*   Des cartographies contemplatives furent injectées dans les véhicules-taxis sans chauffeur qui pullulaient dans les sociétés occidentales, dotant les trajets d'un mode « esthétique » de circulation s'activant en fonction des trajets planifiés. Les objets « connectés » étaient aussi touchés, eux qui demandaient toujours plus de temps et de « mises à jour ». Les montres, lampes, chauffage, prothèses et autres gadgets « intelligents » ne transmettaient plus les données à des grands centres protégés (agencés globalement, donc verticalement), mais apprenaient à se connaître (horizontalement, par affinités électives).</span></p><p class="c0"><span></span></p><p class="c1"><span>## QUELS FINANCEMENTS ?</span></p><p class="c1"><span>En réponse au temps inhumain du *high-frequency trading* `[goto == Alexandre Laumonier]` permettant de gagner des dizaines de milliards de dollars de cotation boursière en jouant sur des différentiels de valeur et de temps infinitésimaux, des hackers avaient mis en application l'idée d'une taxe « pollen » sur les transactions `[goto == Yann Moulier Boutang]`, mais d'une façon progressive, fondée sur la vitesse de calcul `[goto == Paul Virilio]`. Les serveurs les plus rapides payaient le plus, sous peine de planter. Ces gains étaient versés aux communautés émergentes `[goto == Comité invisible]` sous forme de *blockchains* (données décentralisées créées par du calcul) qui rendaient enfin viable l'idée d'une monnaie dénationalisée `[goto == Satoshi Nakamoto]` à échelle mondiale. Plus le système boursier cherchait à se renforcer, plus il affaiblissait l'efficacité des monopoles.</span></p><p class="c0"><span></span></p><p class="c1"><span>## QUELLES PERTES ?</span></p><p class="c1"><span>Ce qu’on appelait « l’Histoire » n’y survécut pas. Écrite par les vainqueurs, elle concentrait toujours les regards sur quelques moments forts, quelques actions, quelques héros et héroïnes isolées du tissu relationnel qui leur a donné consistance. Ne restait que cette consistance : le bug coupait systématiquement toutes les têtes qui dépassaient pour s’individualiser par des processus de célébration `[goto == Nathalie Heinich, Barbara Carnevali, Antoine Lilti]`. Plus d’histoire de l’art ni de la littérature, donc plus d’art ni de littérature. Les vieilles perruques se lamentaient : un monde sans histoire, un monde sans mémoire ! Un monde sans civilisation ! Un retour à la sauvagerie ! À l’immédiateté ! Un monde « post-historique », comme l’avait annoncé Vilém Flusser depuis bien des lunes. On y entrait enfin.</span></p><p class="c0"><span></span></p><p class="c1"><span>## QUEL NOUVEAU MONDE ?</span></p><p class="c1"><span>La pâleur, la lèpre, puis la disparition des surexposés avait complètement redistribué l’attention collective. Des myriades de pratiques alternatives étaient redevenues visibles – mais seulement à petite échelle et à portée locale. Tout ce qui aurait pu menacer de reprendre le dessus s’effaçait de par son succès même. Cette écologie logicielle formait un nouveau milieu attentionnel reconfigurant en profondeur nos relations aux machines et à autrui `[goto == Andrea Branzi]`. Tout le monde trouvait ce nouveau paysage beaucoup plus riche et plus enrichissant. Un nouveau système d’allocation des ressources se substituait à l’ancien.</span></p><p class="c0"><span></span></p><p class="c1"><span>## QUELLES MÉDIATIONS ?</span></p><p class="c1"><span>Les catastrophistes levaient les bras au ciel. Les cyniques se moquaient de la naïveté de ces rêves d’immédiateté. Les bidouilleurs bidouillaient. Ils vivaient au coeur battant des media : pour rien au monde, ils n’auraient pu croire pouvoir s’en passer. Le bug n’avait rongé, corrodé, neutralisé les effets grégaires de l’attention machinique que pour mieux mettre les machines numériques au service de l’attention humaine. Oui, l’attention « immédiate » échappait à la lèpre : mille, dix mille, cent mille personnes pouvaient venir voir où écouter un artiste ou un chanteur (en *live*) sans donner aucune prise à l’algorithme. Mais non, il n’y avait pas besoin de retourner aux pigeons voyageurs pour communiquer. On en restait à des petits réseaux (pas forcément locaux), qui veillaient à ne pas se laisser emballer dans les grandes résonances décervelées. On pouvait varier les formulations pour éviter de répéter les mêmes mots qui auraient menacé de s’effacer. Chacun(e) devenait poète. Bien sûr, on avait inventé une fonction automatique **COPIER-VARIER**, pour que la machine devienne poète à notre place, mais cela même ne faisait que réinventer (avec variation) l’écriture automatique rêvée par les surréalistes. On s’acclimatait à un monde d’archipels diversifiés sans regretter le monde de _hubs_ standardisés qui s’était dissout avec l’effondrement du capitalisme globalisé.</span></p><p class="c0"><span></span></p><p class="c1"><span>## HANTOLOGIE (bis)</span></p><p class="c1"><span>Bien sûr, on n’avait nullement échappé aux fantômes. Heureusement !  Comme cela avait toujours été le cas, ils flottaient entre nos esprits, nos corps, nos désirs, nos souvenirs, nos espoirs et nos craintes. On continuait à se profiler sur les réseaux, à se reluquer dans les bars, à se soupeser sur regard en se croisant dans la rue. L’exploit avait simplement réduit la tailles des spectres. Moins à une taille « humaine » qu’à une taille *ambiantale* `[goto == Henry Torgue &amp; Igor Galligo]`. Les fantômes habitaient (et rendaient habitables) des lieux de vie reconnectés à leur milieu de soutenabilité. On pouvait « s’y sentir » (bien ou mal), et on pouvait agir sur eux pour les reconfigurer, les améliorer, à une échelle ambiantale. Certains flux d’information continuaient à traverser la planète – nulle séparation possible entre chez nous et chez eux, on respirait le même air, buvait la même eau, baignait dans les mêmes accumulations de pesticides, d’antibiotiques, de radiations et autres nanosaloperies. Les luttes se poursuivaient, les conflits se renouvelaient – nul Eden de circuits courts. On communiquait, donc on hallucinait, comme toujours, donc on multipliait les spectres comme opérateurs de médiation. Et les algorithmes continuaient à mouliner pour reprofiler ces spectres. On avait accepté d’être tous des morts-vivants. Le défi quotidien était d’être un peu plus vivant que mort. **APRÈS** le hack, le numérique réflexif redimensionné nous permettait de l’être un peu plus souvent qu’**AVANT**. C’était tout. Ce n’était pas rien.</span></p><p class="c0"><span></span></p><p class="c0"><span></span></p><p class="c0"><span></span></p><p class="c0"><span></span></p><p class="c0"><span></span></p><div><p class="c0 c11"><span class="c9"></span></p></div></div>